In [2]:
import pandas as pd
import numpy as np

In [19]:

data = {"Animals":['cat','cat','turtle','dog','dog','cat','turtle','cat','dog','dog'],
        "Age":[2.5,3,0.5,np.nan,5,2,4.5,np.nan,7,3],
       "visits":[1,3,2,3,2,3,1,1,2,1],
       "priority":['y','y','n','y','n','n','n','y','n','n']
       }
animals_data = pd.DataFrame(data)

In [18]:
animals_data.head(5)

  Animals  Age  visits priority
0     cat  2.5       1        y
1     cat  3.0       3        y
2  turtle  0.5       2        n
3     dog  NaN       3        y
4     dog  5.0       2        n

In [24]:
print("Animals_values",animals_data.values)

Animals_values [['cat' 2.5 1 'y']
 ['cat' 3.0 3 'y']
 ['turtle' 0.5 2 'n']
 ['dog' nan 3 'y']
 ['dog' 5.0 2 'n']
 ['cat' 2.0 3 'n']
 ['turtle' 4.5 1 'n']
 ['cat' nan 1 'y']
 ['dog' 7.0 2 'n']
 ['dog' 3.0 1 'n']]

In [12]:
Age = 10
Age = "ten"

In [21]:
animals_data.sample(3)

  Animals  Age  visits priority
6  turtle  4.5       1        n
5     cat  2.0       3        n
9     dog  3.0       1        n

In [32]:
animals_data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 4 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   Animals   10 non-null     object
 1   Age       8 non-null      float64
 2   visits    10 non-null     int64
 3   priority  10 non-null     object
dtypes: float64(1), int64(1), object(2)
memory usage: 448.0+ bytes

In [26]:
animals_data.describe()

            Age     visits
count  8.000000  10.000000
mean   3.437500   1.900000
std    2.007797   0.875595
min    0.500000   1.000000
25%    2.375000   1.000000
50%    3.000000   2.000000
75%    4.625000   2.750000
max    7.000000   3.000000

In [27]:
animals_data.describe(include=['object'])

       Animals priority
count       10       10
unique       3        2
top        dog        n
freq         4        6

In [28]:
animals_data.head()

  Animals  Age  visits priority
0     cat  2.5       1        y
1     cat  3.0       3        y
2  turtle  0.5       2        n
3     dog  NaN       3        y
4     dog  5.0       2        n

In [30]:
animals_data.sort_values(by='Age')

  Animals  Age  visits priority
2  turtle  0.5       2        n
5     cat  2.0       3        n
0     cat  2.5       1        y
1     cat  3.0       3        y
9     dog  3.0       1        n
6  turtle  4.5       1        n
4     dog  5.0       2        n
8     dog  7.0       2        n
3     dog  NaN       3        y
7     cat  NaN       1        y

In [31]:
animals_data.sort_values(by='Age',ascending=False)

  Animals  Age  visits priority
8     dog  7.0       2        n
4     dog  5.0       2        n
6  turtle  4.5       1        n
1     cat  3.0       3        y
9     dog  3.0       1        n
0     cat  2.5       1        y
5     cat  2.0       3        n
2  turtle  0.5       2        n
3     dog  NaN       3        y
7     cat  NaN       1        y

# Aggregate Functions

In [33]:
sample_data = animals_data[['Age','visits']]

In [34]:
# Aggreegate Functions
print("Mean of the dataframe",sample_data.mean())

Mean of the dataframe Age       3.4375
visits    1.9000
dtype: float64

In [36]:
# Find null values
animals_data.isnull()

   Animals    Age  visits  priority
0    False  False   False     False
1    False  False   False     False
2    False  False   False     False
3    False   True   False     False
4    False  False   False     False
5    False  False   False     False
6    False  False   False     False
7    False   True   False     False
8    False  False   False     False
9    False  False   False     False

In [35]:
#Count of Null values. np.nan is null
animals_data.isnull().sum()

Animals     0
Age         2
visits      0
priority    0
dtype: int64

In [37]:
# Imputing
print(0*np.nan)

nan

In [38]:
print(1+np.nan)

nan

In [39]:
vals = np.array([1,np.nan,3,4])

In [41]:
#Problem - It is not giving sum, min and max value
print("Array",vals)
print(vals.sum())
print(vals.min())
print(vals.max())

Array [ 1. nan  3.  4.]
nan
nan
nan

In [42]:
# Solution - by adding - nan - it gives proper output
# np is numpy (Numpy is library)

print("Array",vals)
print(np.nansum(vals))
print(np.nanmin(vals))
print(np.nanmax(vals))

Array [ 1. nan  3.  4.]
8.0
1.0
4.0

In [47]:
# How to find missing values. How to find null values
data = pd.Series([1,np.nan,'hello',None])

In [44]:
print("Series is",data)

Series is 0        1
1      NaN
2    hello
3     None
dtype: object

In [45]:
print("data.isnull()",data.isnull())

data.isnull() 0    False
1     True
2    False
3     True
dtype: bool

In [49]:
data.notnull()

0     True
1    False
2     True
3    False
dtype: bool

In [46]:
data[data.notnull()]

0        1
2    hello
dtype: object

In [51]:

df = pd.DataFrame(([1,np.nan,2],
                 [2,  3,  5],
                 [np.nan,4,  6]))
print(df)

     0    1  2
0  1.0  NaN  2
1  2.0  3.0  5
2  NaN  4.0  6

In [54]:
df

     0    1  2
0  1.0  NaN  2
1  2.0  3.0  5
2  NaN  4.0  6

In [52]:
print(df.dropna())

     0    1  2
1  2.0  3.0  5

In [55]:
# Drop Null Value
print(df.dropna(how='any'))

     0    1  2
1  2.0  3.0  5

In [56]:
print(df.dropna(how='all'))

     0    1  2
0  1.0  NaN  2
1  2.0  3.0  5
2  NaN  4.0  6

In [57]:
df.dropna(how='any', inplace=True)

In [58]:
df

     0    1  2
1  2.0  3.0  5

In [59]:
# Create dataFrame
df = pd.DataFrame(([1,np.nan,2],
                 [2,  3,  5],
                 [np.nan,4,  6]))
print(df)

     0    1  2
0  1.0  NaN  2
1  2.0  3.0  5
2  NaN  4.0  6

In [60]:
# Drop row
print(df.dropna())

     0    1  2
1  2.0  3.0  5

In [61]:
# Drop Column
print(df.dropna(axis='columns'))

   2
0  2
1  5
2  6

In [62]:
# How to Fill null Values
data = pd.Series([1,np.nan,2,None,3],index=list('abcde'))
print(data)

a    1.0
b    NaN
c    2.0
d    NaN
e    3.0
dtype: float64

In [63]:
print(data.fillna(0))

a    1.0
b    0.0
c    2.0
d    0.0
e    3.0
dtype: float64

In [64]:
#Forward Fill
print(data.fillna(method='ffill'))

a    1.0
b    1.0
c    2.0
d    2.0
e    3.0
dtype: float64

In [66]:
# Backward Fill
print(data.fillna(method='bfill'))

a    1.0
b    2.0
c    2.0
d    3.0
e    3.0
dtype: float64

In [65]:
animals_data.shape

(10, 4)

In [68]:
animals_data.head(10)

  Animals  Age  visits priority
0     cat  2.5       1        y
1     cat  3.0       3        y
2  turtle  0.5       2        n
3     dog  NaN       3        y
4     dog  5.0       2        n
5     cat  2.0       3        n
6  turtle  4.5       1        n
7     cat  NaN       1        y
8     dog  7.0       2        n
9     dog  3.0       1        n

In [69]:
# Saving the dataframe to Local Machine
animals_data.to_csv("animals.csv")

In [70]:
read_animals_data = pd.read_csv("animals.csv")

In [73]:
read_animals_data.head(10)

   Unnamed: 0 Animals  Age  visits priority
0           0     cat  2.5       1        y
1           1     cat  3.0       3        y
2           2  turtle  0.5       2        n
3           3     dog  NaN       3        y
4           4     dog  5.0       2        n
5           5     cat  2.0       3        n
6           6  turtle  4.5       1        n
7           7     cat  NaN       1        y
8           8     dog  7.0       2        n
9           9     dog  3.0       1        n

In [74]:
import os
os.getcwd()

'C:\\Users\\shivani.rana\\Desktop\\Assignments\\Python Classes'

In [75]:
# If we add index = False then Index Column will be deleted. 
# Please see the difference between above and below output
animals_data.to_csv("animals.csv",index=False)

In [76]:
read_animals_data = pd.read_csv("animals.csv")

In [77]:
animals_data.head(10)

  Animals  Age  visits priority
0     cat  2.5       1        y
1     cat  3.0       3        y
2  turtle  0.5       2        n
3     dog  NaN       3        y
4     dog  5.0       2        n
5     cat  2.0       3        n
6  turtle  4.5       1        n
7     cat  NaN       1        y
8     dog  7.0       2        n
9     dog  3.0       1        n

In [78]:
# How to write file in another Format
animals_data.to_excel('animal.xlsx',sheet_name='sheet1')

# In cso that ase, lets assume that null values are reprsented as 'n' in priority column
# But any programming language looks that as alphabet n, not null
#
#One Way - is to replace with n with np.nan(null) so that python will understand
# In read Excel method, there is option to specify something called na_values = 'n'

In [87]:
read_animal_excel = pd.read_excel('animal.xlsx','sheet1',
                                 index_col=None,na_values=['y'])
read_animal_excel.head(5)

   Unnamed: 0 Animals  Age  visits priority
0           0     cat  2.5       1      NaN
1           1     cat  3.0       3      NaN
2           2  turtle  0.5       2        n
3           3     dog  NaN       3      NaN
4           4     dog  5.0       2        n

In [86]:
read_animal_excel = pd.read_excel('animal.xlsx','sheet1',
                                 index_col=None,na_values=['NA'])
read_animal_excel.head(5)

   Unnamed: 0 Animals  Age  visits priority
0           0     cat  2.5       1        y
1           1     cat  3.0       3        y
2           2  turtle  0.5       2        n
3           3     dog  NaN       3        y
4           4     dog  5.0       2        n

In [85]:
read_animal_excel = pd.read_excel('animal.xlsx','sheet1',
                                 index_col=None,na_values=['n'])
read_animal_excel.head(5)

   Unnamed: 0 Animals  Age  visits priority
0           0     cat  2.5       1        y
1           1     cat  3.0       3        y
2           2  turtle  0.5       2      NaN
3           3     dog  NaN       3        y
4           4     dog  5.0       2      NaN